In [41]:
import pandas as pd
import numpy as np

In [42]:
data=pd.read_csv('NaiveBayes.csv')
data.head()

   Age  Salary  Purchased
0   19   19000          0
1   35   20000          0
2   26   43000          0
3   27   57000          0
4   19   76000          0

In [43]:
data.shape

(400, 3)

In [44]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Age        400 non-null    int64
 1   Salary     400 non-null    int64
 2   Purchased  400 non-null    int64
dtypes: int64(3)
memory usage: 9.5 KB

In [45]:
data.describe()

              Age         Salary   Purchased
count  400.000000     400.000000  400.000000
mean    37.655000   69742.500000    0.357500
std     10.482877   34096.960282    0.479864
min     18.000000   15000.000000    0.000000
25%     29.750000   43000.000000    0.000000
50%     37.000000   70000.000000    0.000000
75%     46.000000   88000.000000    1.000000
max     60.000000  150000.000000    1.000000

In [46]:
data.head()

   Age  Salary  Purchased
0   19   19000          0
1   35   20000          0
2   26   43000          0
3   27   57000          0
4   19   76000          0

In [47]:
data = pd.read_csv('NaiveBayes.csv')

In [48]:
feature_col=['Age','Salary']
x=data[feature_col]
y=data.Purchased

In [49]:
x.shape

(400, 2)

In [50]:
y.shape

(400,)

In [51]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test =train_test_split(x,y,test_size= 0.25, random_state=0)

In [52]:
from sklearn.naive_bayes import MultinomialNB
from sklearn.metrics import accuracy_score
model3=MultinomialNB()
model3.fit(x_train,y_train)
ypre=model3.predict(x_test)
accuracy3=accuracy_score(ypre,y_test)
accuracy3

0.59

In [53]:
from sklearn.naive_bayes import BernoulliNB
from sklearn.metrics import accuracy_score
model=BernoulliNB()
model.fit(x_train,y_train)
y_pre=model.predict(x_test)
accuracy=accuracy_score(y_pre,y_test)
accuracy

0.68

In [54]:
from sklearn.naive_bayes import GaussianNB
from sklearn.metrics import accuracy_score
model2=GaussianNB()
model2.fit(x_train,y_train)
y_pre=model2.predict(x_test)
accuracy2=accuracy_score(y_pre,y_test)
accuracy2

0.9